import React, {FC} from 'react'
import PageTitle from 'components/pageTitle/PageTitle'
import iconController from './img/controller.svg'
import iconKnow from './img/knowledge.svg'
import iconHero from './img/superhero.svg'
// import iconGem from './img/gem.svg'
import iconMultiHero from './img/multihero.svg'
import iconBook from './img/book.svg'
import iconButtonCreate from './img/button.svg'
import iconCreateChar1 from './img/per1.png'
import iconCreateChar2 from './img/per2.png'
import iconComp1 from './img/comp1.png'
import iconComp2 from './img/comp2.png'
import iconPlay1 from './img/play1.png'
import iconPlay3 from './img/play3.png'
import iconPlay4 from './img/play4.png'
import Block from './Block'
import {Col, Row} from 'react-bootstrap'
import Page from '../../../components/page/Page'

// Страница "Как начать игру"
const HowPage: FC = () => {

    return (
        <Page>
            <PageTitle icon={iconController} title="Как начать игру"/>
            <Block icon={iconController} title="Вход в игру">
                <p>1) Как только запустился лаунчер нажмите кнопку “Обновить” чтобы загрузить все последние
                    обновления.</p>

                <p>2) Как все обновления успешно установились, можете нажать кнопку “Запустить игру”</p>

                <p>3) Игра запущена, поздравляю, теперь вам потребуется залогиниться под своими данными, которые вы
                    указывали при регистрации аккаунта.</p>

                <p>4) Если вы успешно вошли под своими данными, переходите к следующему пункту.</p>
            </Block>

            <Block icon={iconKnow} title="Продумывание персонажа">
                <Row><Col md={8}><p>Ваша задача придумать вашего персонажа, для этого перейдите в раздел “Материалы /
                    Персонажи” и
                    создайте его там.</p></Col><Col md={4}><p><img className="min-w-auto" src={iconButtonCreate}
                                                                   alt=""/></p></Col></Row>
                <p>Перед вами редактор, заполните все необходимые поля, придумайте историю вашего персонажа, опишите его
                    внешность и характер, а так же характеристики и имя.</p>
                <p className="color-1">ДОПОЛНЕНИЕ:</p>

                <p>Итак, в вашей голове появляются мысли, видимый образ будущего героя. Кто же это? Гордый и благородный
                    человек, избравший путь рыцаря-паладина? Может быть, наемник или солдат? Разбойник или стражник?</p>
                <p>"Меня зовут Кристиан Андатре, я высокий, мускулистый и красивый представитель человеческой расы.
                    Долгие годы я занимаюсь работой по найму, а потому не особо сговорчив. Да, я молчалив, но за меня
                    говорит мой верный спутник - двуручный меч, вкусивший столько крови врагов, сколько не видел ни один
                    солдат. Всю свою жизнь я провел в нищете, мои родители погибли от болезни, мне пришлось выживать и
                    искать себе средства для пропитания. С тех пор я не выпускаю из рук меч."</p>
                <p>Ну как? Коротко и по делу, а самое главное - интересно. Это ваш персонаж и вы вольны придумать ему
                    любую историю. В пределах разумного, конечно.</p>
            </Block>

            <Block icon={iconHero} title="Создание персонажа">
                <p>1) Наконец, у вас есть представление о том, кого вы будете играть. Знаете, какая у него внешность,
                    какой характер. Сейчас предстоит перенести придуманный образ в игру.</p>
                <p>2) Вы должны зайти в меню выбора персонажа и нажать на кнопку "Новый персонаж", после чего просто
                    выбрать расу, класс и кастомизировать его внешность.
                    Готово. Осталось имя. Щелкайте по окошку имени и вписывайте туда его. У нас это уже известный всем
                    Кристиан. Имя занято? Не беда! Пусть его ник будет "Анданте".</p>
                <p>3) После создания кастомизированного персонажа вам необходимо нажать "Принять". Персонаж появится в
                    специальном окне, откуда вы можете выбрать его. Входим в игровой мир нажатием кнопки "Вход в игровой
                    мир".</p>
                <Row><Col md={6}><p><img className="mw-100 min-w-auto" src={iconCreateChar1} alt=""/></p></Col><Col
                    md={6}><p><img
                    className="mw-100" src={iconCreateChar2} alt=""/></p></Col></Row>

            </Block>

            {/*<Block icon={iconGem} title="Трансмогрификация">*/}
            {/*    <p>*/}
            {/*        Трансмогрификация (трансмоги) - это очень тонкое дело. Для начала вы должны перейти на сайт по*/}
            {/*        кнопке*/}
            {/*        справа и собрать набор одежды и оружия из понравившихся вещей там, после чего найти их ID*/}
            {/*        (item=######, где # и есть ID) и с помощью команды .disp ###### вещь появится в вашем инвентаре.*/}
            {/*        Осталось лишь надеть ее на себя и вуаля! Вы одеты с иголочки!</p>*/}
            {/*</Block>*/}

            <Block icon={iconMultiHero} title="Влейтесь в компанию">
                <p>Наконец, мы закончили с внешним и внутренним видами нашего героя и готовы приступать к игре. Для
                    этого вам необходимо воспользоваться одним из порталов на точке спавна и найти соотечественников в
                    населенном игроками городе. А далее все очень просто - исполняйте свою роль!
                    Помните, кем является наш персонаж? Хмурый и неразговорчивый, но внушающий страх и уважение наемник
                    Кристиан Анданте. Он придет в городскую таверну и за кружкой-другой эля расскажет проговорится
                    другому персонажу про свои приключения. А может быть затеет драку с горячей головы? Кто знает? На то
                    - ваша воля. Но помните, что Вы и только Вы несете ответственность за своего персонажи и его
                    поступки в игре.</p>

                <Row><Col md={6}><p><img className="mw-100" src={iconComp1} alt=""/></p></Col><Col md={6}><p><img
                    className="mw-100" src={iconComp2} alt=""/></p></Col></Row>
            </Block>

            <Block icon={iconBook} title="Играйте в сюжетах">
                <p>Поздравляем, вы научились взаимодействовать с окружением и прочими игроками. Но посиделки в таверне и
                    прогулки по городу вам наскучили? Не беда, ведь на нашем проекте есть мастера, гильдии и сюжеты,
                    которые могут предоставить захватывающую игру! Эпичные битвы, красочные локации, угроза ранений и
                    смерти и многое другое ждет вас на этом пути. Проявляйте активность, вносите свой вклад в развитие
                    сервера и вы обязательно получите запоминающуюся награду!</p>
                <Row><Col md={6}><p><img className="mw-100" src={iconPlay1} alt=""/></p></Col><Col md={6}><p><img
                    className="mw-100" src={iconPlay1} alt=""/></p></Col></Row>
                <Row><Col md={6}><p><img className="mw-100" src={iconPlay3} alt=""/></p></Col><Col md={6}><p><img
                    className="mw-100" src={iconPlay4} alt=""/></p></Col></Row>
            </Block>
        </Page>
    )
}

export default HowPage